FV2304/E_0456.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">Dummy Chapter</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">Dummy Subchapter</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0456</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> LF</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Handelt es sich bei der Marktlokation um eine verbrauchende Marktlokation?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Für diese Marktlokation ist kein Lieferschein zu versenden.<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Liegt das Endedatum des Zeitraums des Lieferscheins in der Zukunft?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Endedatum liegt in der Zukunft.<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Entspricht der Typ dieses Lieferscheins (Grund-/Arbeitspreis bzw. Arbeits-/Leistungspreis) für den übermittelten Zeit-raum mit der an der Marktlokation hinterlegten Netznutzungsabrechnungsvariante (Grund-/Arbeitspreis bzw. Arbeits-/Leistungspreis)?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der Typ des Lieferscheins ist nicht identisch zur Netznutzungsabrechnungsvariante.<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Handelt es sich um einen Lieferschein vom Typ „Grund-/ Arbeitspreis“?<BR align="left"/>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Liegt in dem Lieferschein genannten Zeitraum mindestens ein Tag eines noch nicht stornierten Lieferscheins?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Überschneidender Zeitraum in noch nicht stornierten Lieferscheinen „Arbeits-/Grundpreis“<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Handelt es sich um eine Marktlokation mit der messtechnischen Einordnung „keine Messung“ (pauschale Marktlokation)?<BR align="left"/>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Entspricht die im Lieferschein übermittelte Energiemenge der Energiemenge, welche sich aus der zuvor für den Zeitraum ausgetauschten Jahresverbrauchsprognose ergibt?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Zustimmung<BR align="left"/>Zustimmung<BR align="left"/></FONT>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemenge für pauschale Marktlokation stimmt nicht überein.<BR align="left"/></FONT>>];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Liegen nach Reklamation beim MSB für den korrespondierenden Zeitraum des Lieferscheins die Energiemengen an der Marktlokation vom MSB vor?<BR align="left"/>Hinweis: Sollten die Energiemengen an der Marktlokation vom MSB für den korrespondierenden Zeitraum nicht vorliegen, müssen diese erst vom LF beim MSB reklamiert worden sein, bevor diese Frage mit nein beantwortet werden darf.<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemengen vom MSB an der Marktlokation fehlen und sind beim MSB reklamiert<BR align="left"/>Hinweis: <BR align="left"/>Die Prüfung des Lieferscheins erfolgt für Leistungszeiträume vor dem 01.12.2019 auf Basis der Werte, die vom NB bzw. vom gMSB übermittelt wurden.<BR align="left"/>Siehe Mitteilung Nr. 6 zur MaKo 2020 (Az.: BK6-18-032) der Bundesnetzagentur vom 28.01.2020.<BR align="left"/></FONT>>];
    "9" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>9: </B>Liegt für den im Lieferschein genannten Zeitraum für eine der genannten OBIS-Kennzahlen eine zusätzliche Energiemenge vor, die noch nicht storniert wurde?<BR align="left"/>>];
    "A08" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A08</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Für einen Zeitabschnitt liegen für mindestens eine OBIS-Kennzahl mehrere Energiemengen vor.<BR align="left"/></FONT>>];
    "10" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>10: </B>Entspricht die zuvor vom MSB übermittelte Summe der Energiemengen je OBIS-Kennzahl der Summe der Energiemengen der aus dem Lieferschein korrespondierenden OBIS-Kennzahl für den vom Lieferschein abgedeckten Zeitraum?<BR align="left"/>>];
    "11" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>11: </B>Handelt es sich um eine Marktlokation, deren Netznutzung aufgrund vertraglicher Vereinbarungen abweichend zu den in GPKE Kapitel II. 6.2 beschriebenen Regelungen abgerechnet wird?<BR align="left"/>>];
    "12" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>12: </B>Entspricht die im Lieferschein übermittelte Energiemenge der Energiemenge, welche sich auf Basis der vertraglichen Vereinbarungen ergibt?<BR align="left"/>>];
    "A09" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A09</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemenge widerspricht vertraglich vereinbarter Logik.<BR align="left"/></FONT>>];
    "13" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>13: </B>Entspricht die zuvor vom MSB übermittelte Summe der Energiemengen der Summe der Energiemengen aus dem Lieferschein für den vom Lieferschein abgedeckten Zeit-raum?<BR align="left"/>>];
    "A10" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A10</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemengen stimmen nicht überein.<BR align="left"/></FONT>>];
    "14" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>14: </B>Handelt es sich um eine Marktlokation mit der messtech-nischen Einordnung „keine Messung“ (pauschale Markt-lokation)?<BR align="left"/>>];
    "15" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>15: </B>Entspricht die Energiemenge aus dem Lieferschein den bilateral vertraglichen Vereinbarungen?<BR align="left"/>>];
    "A11" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A11</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemenge für pauschale Marktlokation stimmt nicht überein.<BR align="left"/></FONT>>];
    "16" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>16: </B>Liegen nach Reklamation für den korrespondierenden Zeit-raum des Lieferscheins die Lastgänge an der Marktlokation vom MSB und ggf. das Leistungsmaximum (bei iMS vom MSB, bei kME mit RLM aus Lastgang vom LF entnommen und bei einem unterjährigen Lieferantenwechsel vom NB) vor?<BR align="left"/>Hinweis: Sollten die Lastgänge an der Marktlokation vom MSB für den korrespondierenden Zeitraum des Lieferscheins nicht vorliegen, müssen diese erst vom LF beim MSB reklamiert worden sein, bevor diese Frage mit nein beantwortet werden darf.<BR align="left"/>>];
    "A12" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A12</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Lastgänge vom MSB an der Marktlokation fehlen und sind beim MSB reklamiert oder vom NB fehlt die Nachricht „Arbeit und Leistungsmaximum Kalenderjahr vor Lieferbeginn".<BR align="left"/></FONT>>];
    "17" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>17: </B>Handelt es sich um eine Marktlokation, deren Netznutzung aufgrund vertraglicher Vereinbarungen abweichend zu den in GPKE Kapitel II. 6.2 beschriebenen Regelungen abgerechnet wird?<BR align="left"/>>];
    "18" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>18: </B>Entspricht die Energiemenge bzw. das Leistungsmaximum aus dem Lieferschein den bilateral vertraglichen Vereinbarungen?<BR align="left"/>>];
    "A13" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A13</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemenge bzw. Leistungsmaximum aus dem Lieferschein entspricht nicht der vertraglich vereinbarten Energiemenge.<BR align="left"/></FONT>>];
    "19" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>19: </B>Handelt es sich um eine Marktlokation mit der messtechnischen Einordnung „iMS“?<BR align="left"/>>];
    "20" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>20: </B>Entspricht das im Lieferschein übermittelte Leistungsmaximum dem Leistungsmaximum, das zuvor vom MSB über-mittelt wurde oder dem Leistungsmaximum, welches bei einem unterjährigen Lieferantenwechsel vom NB an den LF übermittelt wurde?<BR align="left"/>>];
    "A14" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A14</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Leistungsmaximum aus dem Lieferschein ist nicht identisch zum vorliegenden Leistungsmaximum.<BR align="left"/></FONT>>];
    "21" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>21: </B>Entspricht das im Lieferschein übermittelte Leistungsmaximum dem vorliegenden Leistungsmaximum beim LF, welches aus dem Lastgang vom MSB entnommen oder das Leistungsmaximum, welches bei einem unterjährigen Lieferantenwechsel vom NB an den LF übermittelt wurde?<BR align="left"/>>];
    "A15" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A15</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Leistungsmaximum unplausibel<BR align="left"/></FONT>>];
    "22" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>22: </B>Entspricht jede auf dem Lieferschein vorkommende Energiemenge je Position (OBIS-Kennzahl und Zeitraum) einer Summe der vom MSB zuvor übermittelten ¼ h-Werte unter Berücksichtigung von möglichen kaufmännischen Rundungen?<BR align="left"/>>];
    "A16" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cca9ab", label=<<B>A16</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Energiemenge aus dem Lieferschein entspricht nicht der Summe aus dem Lastgang.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label="Nein"];
    "1" -> "2" [label="Ja"];
    "2" -> "A02" [label="Ja"];
    "2" -> "3" [label="Nein"];
    "3" -> "A03" [label="Nein"];
    "3" -> "4" [label="Ja"];
    "4" -> "5" [label="Ja"];
    "4" -> "14" [label="Nein"];
    "5" -> "A04" [label="Ja"];
    "5" -> "6" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "6" -> "8" [label="Nein"];
    "7" -> "A05" [label="Ja"];
    "7" -> "A06" [label="Nein"];
    "8" -> "A07" [label="Nein"];
    "8" -> "9" [label="Ja"];
    "9" -> "A08" [label="Ja"];
    "9" -> "10" [label="Nein"];
    "10" -> "A05" [label="Ja"];
    "10" -> "11" [label="Nein"];
    "11" -> "12" [label="Ja"];
    "11" -> "13" [label="Nein"];
    "12" -> "A05" [label="Ja"];
    "12" -> "A09" [label="Nein"];
    "13" -> "A05" [label="Ja"];
    "13" -> "A10" [label="Nein"];
    "14" -> "15" [label="Ja"];
    "14" -> "16" [label="Nein"];
    "15" -> "A05" [label="Ja"];
    "15" -> "A11" [label="Nein"];
    "16" -> "A12" [label="Nein"];
    "16" -> "17" [label="Ja"];
    "17" -> "18" [label="Ja"];
    "17" -> "19" [label="Nein"];
    "18" -> "A05" [label="Ja"];
    "18" -> "A13" [label="Nein"];
    "19" -> "20" [label="Ja"];
    "19" -> "21" [label="Nein"];
    "20" -> "A14" [label="Nein"];
    "20" -> "22" [label="Ja"];
    "21" -> "A15" [label="Nein"];
    "21" -> "22" [label="Ja"];
    "22" -> "A05" [label="Ja"];
    "22" -> "A16" [label="Nein"];
}
